# AnalyticalPanelNotVisible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalPanelNotVisible Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Analytical Panel is not visible in the current view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalPanelNotVisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalPanelNotVisible As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalPanelNotVisible {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace